Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ПакетыДокументовДля1САрхива/ПакетыДокументовДля1САрхива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПакетыДокументовДля1САрхива</name>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Передал</name>
    <type>
      <types>DefinedType.ФизическоеЛицоБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ПодразделениеБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Принял</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>DefinedType.ФизическоеЛицоБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбменаСАрхивом</name>
    <type>
      <types>EnumRef.СтатусыОбменаС1САрхивом</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>DefinedType.СотрудникБИА</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ДокументыБИА</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Зарплата_и_Управление_Персоналом_демо/src/CommonModules/ОбменСАрхивомВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Скачивает контейнер документа из 1С:Архива и сохраняет его во времнное хранилище.
//
// Параметры:
//  Документ - СправочникСсылка.ДокументыБИА - документ.
//
// Возвращаемое значение:
//  Структура:
//    * Имя - Строка - имя файла
//    * Расширение - Строка - расширение файла
//    * АдресДвоичныхДанных - Строка - адрес двоичных данных 
// 
Функция СкачатьКонтейнерДокумента(Знач Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка при скачивании контейнера документа: параметр Документ не заполнен.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если ТипЗнч(Документ) <> Тип("СправочникСсылка.ДокументыБИА") Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка при скачивании контейнера документа: неожиданный тип параметра Документ'")
			+ " (" + ТипЗнч(Документ) + ").";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВебАдрес = Константы.АдресПубликации1САрхива.Получить();
	ИмяПользователя = Константы.ИмяПользователя1САрхива.Получить();
	Если Не ЗначениеЗаполнено(ВебАдрес) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1"".'"),
			Метаданные.Константы.АдресПубликации1САрхива.Синоним);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1"".'"),
			Метаданные.Константы.ИмяПользователя1САрхива.Синоним);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВладелецХранилища = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Константы.ИмяПользователя1САрхива);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецХранилища);
	
	Если Не ЗначениеЗаполнено(ВебАдрес) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1""'"),
			Метаданные.Константы.АдресПубликации1САрхива.Синоним);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1""'"),
			Метаданные.Константы.ИмяПользователя1САрхива.Синоним);
	КонецЕсли;
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ВебАдрес);
	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
	КонецЕсли;
	
	WSОпределения = Новый WSОпределения(ВебАдрес + "/ws/ArchiveDocuments.1cws?wsdl", ИмяПользователя, Пароль, ИнтернетПрокси);
	Прокси = Новый WSПрокси(WSОпределения, "http://www.1c.ru/docmng", "ArchiveDocuments", "ArchiveDocumentsSoap", ИнтернетПрокси);
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль = Пароль;
	
	ДанныеФайла = Прокси.GetContainer(ОбменСАрхивом.ИдентификаторСсылки(Документ));
	СведенияОФайлеДляКлиента = Новый Структура;
	СведенияОФайлеДляКлиента.Вставить("Имя", Строка(ДанныеФайла.Name));
	СведенияОФайлеДляКлиента.Вставить("Расширение", Строка(ДанныеФайла.Extension));
	СведенияОФайлеДляКлиента.Вставить("АдресДвоичныхДанных",
		ПоместитьВоВременноеХранилище(ДанныеФайла.BinaryData));
	
	Возврат СведенияОФайлеДляКлиента;
	
КонецФункции

// Краткое словеное описание назначения и/или принципов работы функции.
//
// Параметры:
//  ОбъектСсылка - Определяемыйтип.СсылкаНаИнтегрируемыйОбъектБИА - интегрируемый объект.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ДокументыБИА, ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА,
//    СправочникСсылка.ПакетыДокументовДля1САрхива - объекты для просмотра истории:
//    сам объект, его документы БИА, пакет документов.
//
Функция ОбъектыИсторииОбменаПоОбъекту(Знач ОбъектСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДокументыБИА.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыБИАПоОбъекту
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|ГДЕ
		|	ДокументыБИА.ОбъектОснование = &ОбъектСсылка
		|	И НЕ ДокументыБИА.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ОбъектСсылка КАК ОбъектИстории
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыБИАПоОбъекту.Ссылка
		|ИЗ
		|	ДокументыБИАПоОбъекту КАК ДокументыБИАПоОбъекту
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПакетыТабЧасть.Ссылка
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТабЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыБИАПоОбъекту КАК ДокументыБИАПоОбъекту
		|		ПО ПакетыТабЧасть.Документ = ДокументыБИАПоОбъекту.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|		ПО ПакетыТабЧасть.Ссылка = Пакеты.Ссылка
		|ГДЕ
		|	НЕ Пакеты.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

// См. ОбменСАрхивом.ФизЛицоТекущегоПользователя
// 
Функция ФизЛицоТекущегоПользователя() Экспорт
	
	Возврат ОбменСАрхивом.ФизЛицоТекущегоПользователя();
	
КонецФункции

#КонецОбласти
